app/controllers/livros_controller.rb

SELECT "livros".* FROM "livros"
---
  def index
    @livros = Livro.all

INSERT INTO "livros" ("title", "author", "rating", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdaasd"], ["author", "asdasd"], ["rating", "asdas"], ["description", "asdas"], ["created_at", "2023-05-05 03:54:52.488534"], ["updated_at", "2023-05-05 03:54:52.488534"]]
---
  def create
    @livro = Livro.new(livro_params)

    respond_to do |format|
      if @livro.save

DELETE FROM "livros" WHERE "livros"."id" = ?  [["id", 1]]
---
  def destroy
    @livro.destroy

SELECT "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_livro
      @livro = Livro.find(params[:id])